app/controllers/events_controller.rb

SELECT "events".* FROM "events"
---
  def index
    @events = Event.all

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_event
      @event = Event.find(params[:id])