app/controllers/organizations_controller.rb

  def index
    @organizations = Organization.all
---
SELECT "organizations".* FROM "organizations"