app/controllers/pages_controller.rb

SELECT "events".* FROM "events" WHERE (privacy = 0)
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "invitations".* FROM "invitations" WHERE (user_id = 716)
---
  def home
    @public_events = Event.all.where("privacy = ?",false)
    @user = User.find(10)
    @invitation = Invitation.all
    @show_events=[]
    @public_events.each do |t|
      @show_events.append(t)
    end
    @invitation.each do |k|

SELECT "users".* FROM "users" WHERE (username LIKE 'fsdaf%')
SELECT "profiles".* FROM "profiles" WHERE (name LIKE 'fsdaf%')
SELECT "organizations".* FROM "organizations" WHERE (name LIKE 'fsdaf%')
---
  def search

    #user search
    @users = User.all.where("username LIKE ?", params[:q] + '%')
    @profile = Profile.all.where("name LIKE ?", params[:q] + '%')
    @distinct_profile =[]
    if @users != []
      @profile.each do |j|
        @users.each do |k|
          if j.user_id = k.id
          else
            @distinct_profile.append(j)
          end
        end
      end
    else
      @profile.each do |name|
        @distinct_profile.append(name)
      end
    end

    #organization search
    @organizations = Organization.all.where("name LIKE ?", params[:q] + '%')

    #event search
    @events = Event.all.where("title LIKE ? OR description LIKE ?", '%' + params[:q] + '%',  '%' + params[:q] + '%')
    @event_organization = []
    @organizations.each do |org|