app/controllers/profiles_controller.rb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 715], ["LIMIT", 1]]
---
  def index
    @profiles = Profile.where(user: current_user)

SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 715], ["LIMIT", 1]]
---
    def set_profile
      @profile = Profile.where(user: current_user)